#На вход подается строка, состоящая из одного числа. Напишите программу, которая удваивает его.
x = input("Введите число:")
print()

